benchmarks/results/auth-serialization/test-signup/optimization-01/sar-metrics/wrk2/wrk_report.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signup
  2 threads and 4 connections
  Thread calibration: mean lat.: 658.005ms, rate sampling interval: 1354ms
  Thread calibration: mean lat.: 638.784ms, rate sampling interval: 1347ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   651.81ms   25.01ms 684.54ms   74.00%
    Req/Sec     1.71      0.45     2.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  660.99ms
 75.000%  669.18ms
 90.000%  676.86ms
 99.000%  684.03ms
 99.900%  685.05ms
 99.990%  685.05ms
 99.999%  685.05ms
100.000%  685.05ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     579.583     0.000000            1         1.00
     606.207     0.100000           10         1.11
     635.391     0.200000           20         1.25
     644.607     0.300000           30         1.43
     651.775     0.400000           40         1.67
     660.991     0.500000           50         2.00
     663.039     0.550000           55         2.22
     665.087     0.600000           62         2.50
     666.111     0.650000           65         2.86
     668.159     0.700000           70         3.33
     669.183     0.750000           75         4.00
     671.231     0.775000           80         4.44
     671.231     0.800000           80         5.00
     672.767     0.825000           83         5.71
     673.279     0.850000           86         6.67
     674.303     0.875000           88         8.00
     676.351     0.887500           89         8.89
     676.863     0.900000           90        10.00
     677.887     0.912500           94        11.43
     677.887     0.925000           94        13.33
     677.887     0.937500           94        16.00
     680.447     0.943750           95        17.78
     680.447     0.950000           95        20.00
     680.959     0.956250           96        22.86
     681.471     0.962500           98        26.67
     681.471     0.968750           98        32.00
     681.471     0.971875           98        35.56
     681.471     0.975000           98        40.00
     681.471     0.978125           98        45.71
     684.031     0.981250           99        53.33
     684.031     0.984375           99        64.00
     684.031     0.985938           99        71.11
     684.031     0.987500           99        80.00
     684.031     0.989062           99        91.43
     685.055     0.990625          100       106.67
     685.055     1.000000          100          inf
#[Mean    =      651.807, StdDeviation   =       25.008]
#[Max     =      684.544, Total count    =          100]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  148 requests in 30.02s, 60.24KB read
Requests/sec:      4.93
Transfer/sec:      2.01KB